{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00b5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "trainable": true, "arguments": {}, "output_shape_type": "raw", "output_shape": null, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "strides": [2, 2], "activation": "linear", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 36, "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "strides": [2, 2], "activation": "linear", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "strides": [2, 2], "activation": "linear", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_4", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_5", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activation": "linear", "units": 100, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activation": "linear", "units": 50, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activation": "linear", "units": 10, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_8", "trainable": true}, "class_name": "ELU"}, {"config": {"use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "units": 1, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.0"}